# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"

# Load/unload environment variables based on $PWD
brew "direnv"

# Go version management
brew "goenv"

# Open source programming language to build simple/reliable/efficient software
brew "go"

# Vi 'workalike' with many additional features
brew "vim"

# Perl binary manager
brew "plenv"
# Perl builder
brew "perl-build"

# Python version management
brew "pyenv"

# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"

# Ruby version manager
brew "rbenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Safely sets global and per-project environment variables
brew "rbenv-vars"
# Install RubyGems as Homebrew formulae
brew "brew-gem"

# Secures, stores, and tightly controls access to secrets
brew "vault"

# Distributed revision control system
brew "git"
# Add GitHub support to git on the command-line
brew "hub"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Git extension for versioning large files
brew "git-lfs"

# Get a file from an HTTP, HTTPS or FTP server
brew "curl"

# Dictionary Server Protocol (RFC2229) client
brew "dict"

# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Uses macOS keychain for storage of AWS credentials
brew "aws-keychain"
# Official Amazon AWS command-line interface
brew "awscli"
cask "aws-vault"



# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
cask "minikube"
# Docker Machine driver for hyperkit
brew "docker-machine-driver-hyperkit"
# Pack, ship and run any application as a lightweight container
brew "docker"

cask "java"
cask "corretto8"

# Search tool like grep, but optimized for programmers
brew "ack"

# GNU binary tools for native development
brew "binutils", link: true

# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"

# Portable Foreign Function Interface library
brew "libffi"

# Perl compatible regular expressions library
brew "pcre"

# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"

# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"

# File comparison utilities
brew "diffutils"

# Create ASCII graphical histograms in the terminal
brew "distribution"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Implementation of the file(1) command
brew "libmagic"
# Utility to determine file types
brew "file-formula"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU awk utility
brew "gawk"
# Program for calculating and printing calendars
brew "gcal"
# GNU compiler collection
brew "gcc"

# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Apply a diff file to an original
brew "gpatch"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Popular GNU data compression program
brew "gzip"
# Improved top (interactive process viewer)
brew "htop"
# Improved colored diff
brew "icdiff"
# Display an interface's bandwidth usage
brew "iftop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Publish-subscribe messaging rethought as a distributed commit log
brew "kafka"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kafkacat"
# Pager program similar to more
brew "less"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Mongrel of mail user agents (part elm, pine, mush, mh, etc.)
brew "mutt"
# Maven version manager
brew "mvnvm"
# Utility for managing network connections
brew "netcat"
# Platform built on V8 to build network applications
brew "node"
# Show ps output as a tree
brew "pstree"
# Monitor data's progress through a pipe
brew "pv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Repository tool for Android development
brew "repo"
# Utility that provides fast incremental file transfer
brew "rsync"
# Build tool for Scala projects
brew "sbt"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Monitors sleep, wakeup, and idleness of a Mac
brew "sleepwatcher", restart_service: true
# netcat on steroids
brew "socat"
# Source-code syntax highlighter
brew "source-highlight"

# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
brew "sshfs"
# Command-line packet analyzer
brew "tcpdump"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Shell completion for Tmuxinator
brew "tmuxinator-completion"
# CLI tool that moves files or folder to the trash
brew "trash"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# VNC server for real X displays
brew "x11vnc"

# Reinstall:
cask "android-sdk"
# Reinstall:
cask "bettertouchtool"
# Reinstall:
cask "calibre"
# Reinstall:
cask "emacs"
# Reinstall:
cask "flux"

# Reinstall:
cask "iterm2"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Reinstall:
cask "font-andale-mono"
# Reinstall:
cask "font-dejavusansmono-nerd-font"
# Reinstall:
cask "font-droidsansmono-nerd-font"
# Reinstall:
cask "font-inconsolata"
# Reinstall:
cask "font-proggyclean-nerd-font"
# Reinstall:
cask "font-proggyclean-nerd-font-mono"
# Reinstall:
cask "jetbrains-toolbox"
# Reinstall:
cask "jettison"
cask "karabiner-elements"
# Reinstall:
cask "keybase"
cask "little-snitch"
cask "mosaic"
# Reinstall:
cask "nightowl"
cask "osxfuse"
# Reinstall:
cask "pallotron-yubiswitch"
cask "visualvm"
cask "xquartz"

